# vim: set ft=ruby:

cask_args appdir: '/Applications'

mas '1Password',           id: 443987910
mas 'Deckset',             id: 847496013
mas 'Keynote',             id: 409183694
mas 'Numbers',             id: 409203825
mas 'PDF Expert',          id: 1055273043
mas 'Pages',               id: 409201541
mas 'Parcel',              id: 639968404
mas 'Pixelmator',          id: 407963104
mas 'Pocket',              id: 568494494
mas 'Reeder',              id: 880001334
mas 'Skitch',              id: 425955336
mas 'Spark',               id: 1176895641
mas 'Tweetbot',            id: 557168941
mas 'Wunderlist',          id: 410628904
mas 'Xcode',               id: 497799835
mas 'You Need a Budget 4', id: 614680722
mas 'iPhoto',              id: 408981381

cask 'aerial'
cask 'alfred'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'libreoffice'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'sequel-pro'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'the-unarchiver'
cask 'tunnelblick'
cask 'vagrant'
cask 'virtualbox'
cask 'whatsapp'

brew 'ansible'
brew 'ctags'
brew 'docker'
brew 'exercism'
brew 'git'
brew 'gnu-tar'
brew 'go'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'keybase'
brew 'macvim'
brew 'mas'
brew 'mtr'
brew 'pstree'
brew 'pwgen'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'watch'
brew 'wget'

# Nine
if Socket.gethostname == 'odin.local'
  cask 'paw'
  brew 'openshift-cli'
end

# Home
if Socket.gethostname == 'thor.local'
  cask 'flux'
  cask 'sonos'
  cask 'steam'
  cask 'utorrent'
  cask 'vlc'
end
