cask_args appdir: '/Applications'

mas '1Password',           id: 443987910
mas 'Deckset',             id: 847496013
mas 'Keynote',             id: 409183694
mas 'Numbers',             id: 409203825
mas 'PDF Expert',          id: 1055273043
mas 'Pages',               id: 409201541
mas 'Parcel',              id: 639968404
mas 'Pixelmator',          id: 407963104
mas 'Pocket',              id: 568494494
mas 'Skitch',              id: 425955336
mas 'Tweetbot',            id: 557168941
mas 'Wunderlist',          id: 410628904
mas 'Xcode',               id: 497799835
mas 'You Need a Budget 4', id: 614680722
mas 'iPhoto',              id: 408981381

cask 'Dash'

brew 'watch'
