# vim: set ft=ruby:

cask_args appdir: '/Applications'

mas '1Password',           id: 443987910
mas 'Bear',                id: 1091189122
mas 'Irvue',               id: 1039633667
mas 'Omnifocus',           id: 867299399
mas 'PDF Expert',          id: 1055273043
mas 'Parcel',              id: 639968404
mas 'Pixelmator',          id: 407963104
mas 'Pocket',              id: 568494494
mas 'Reeder',              id: 880001334
mas 'SleepTime',           id: 465772885
mas 'Skitch',              id: 425955336
mas 'Spark',               id: 1176895641
mas 'Tweetbot',            id: 557168941
mas 'Xcode',               id: 497799835
mas 'You Need a Budget 4', id: 614680722
mas 'Next Meeting',        id: 1017470484

cask 'aerial'
cask 'alfred'
cask 'bitbar'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'hazel'
cask 'iterm2'
cask 'java'
cask 'libreoffice'
cask 'macvim'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'tunnelblick'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'whatsapp'

brew 'ansible'
brew 'ctags'
brew 'exercism'
brew 'git'
brew 'gnu-tar'
brew 'htop'
brew 'httpie'
brew 'mas'
brew 'mtr'
brew 'npm'
brew 'openshift-cli'
brew 'pstree'
brew 'pwgen'
brew 'reattach-to-user-namespace' # for tmux
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'watch'
brew 'wget'

brew 'bundler-completion'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'launchctl-completion'

# Fonts
tap 'caskroom/fonts'
cask 'font-droidsansmono-nerd-font'
cask 'font-fira-code'

# Go
brew 'go'
tap 'go-task/tap'
brew 'go-task'
brew 'dep'

# Nine
if Socket.gethostname == 'odin.local'
end

# Home
if Socket.gethostname != 'odin.local'
  cask 'arq'
  cask 'gog-galaxy'
  cask 'steam'
  cask 'vlc'
end
